{
  "id": "congregationalPrayerSection",
  "title": "Congregational Prayer",
  "pagination": {
    "previous": "Private Supplications After Salaat",
    "next": "Traveller’s Prayer"
  },
  "sections": [
    {
      "heading": "Congregational Prayer",
      "id": "congregationalPrayer",
      "content": [
        {
          "eleType": "p",
          "id": "",
          "classes": "",
          "insertion": { "location": "", "recitationId": [] },
          "txt": [
            "Performance of the prayer together with the other Muslims in congregation at Mosques is a duty required from every male Muslim of sound mind. Allah (SWT) says:"
          ]
        },
        {
          "eleType": "quote",
          "id": "",
          "classes": "arabicTxt",
          "insertion": { "location": "", "recitationId": [] },
          "txt": [
            "'وَأَقِيمُوا الصَّلَاةَ وَآتُوا الزَّكَاةَ وَارْكَعُوا مَعَ الرَّاكِعِينَ'(2:43)"
          ]
        },
        {
          "eleType": "quote",
          "id": "",
          "classes": "arabicTranslation",
          "insertion": { "location": "", "recitationId": [] },
          "txt": [
            "'...And bow down your heads with those who bow down (in worship)'. (Qur'an 2:43)"
          ]
        },
        {
          "eleType": "p",
          "id": "",
          "classes": "",
          "insertion": { "location": "", "recitationId": [] },
          "txt": [
            "Much emphasis has also been made by the Prophet (PBUH) about the Congregational Prayers as can be gathered from the following authentic sayings:"
          ]
        },
        {
          "eleType": "ol",
          "id": "",
          "classes": "",
          "insertion": { "location": "", "recitationId": [] },
          "txt": [
            "'Performing prayer in congregation is 27 times better than prayer performed on individual basis'.(Reported by Imam Bukhari)قال رسول الله صلى الله عليه وسلم : ‘صلاة أحدكم في جماعة ، تزيد على صلاته في سوقه وبيته بضعاً وعشرين درجة’",
            "Ibn Maktum said: 'I told the Messenger of Allah that I am blind and my house is far away and I have no suitable guide to the mosque.. do I not have permission to pray at home?' The Prophet (PBUH), asked me: 'Do you hear the call to the prayer?' I answered: 'Yes', and the Prophet (PBUH) then said to me:Respond accordingly (by coming to the mosque)'. (Reported by Imam Muslim) أتى النبي صلى الله عليه وسلم رجل أعمى ، فقال : يا رسول الله ، إنه ليس لي قائد يقودني إلى المسجد ، فسأل رسول الله صلى الله عليه وسلم أن يرخص له فيصلي في بيته ، فرخص له ، فلما ولى دعاه فقال : ((هل تسمع النداء بالصلاة ؟)) فقال : نعم ، قال : ((فأجب)) .",
            "'If there happens to be (even) three persons in a village, desert or jungle and they do not pray in congregation, Satan would surely dominate them. So, observe your prayers in congregation, for certainly, the wolf devours the lonely sheep'. (Reported by Abu Dawoud)",
            "'I swear by Allah in Whose possession is my life, I feel like asking for firewood to be gathered, and order for the prayer to be held and the call for prayer (Adhaan) to be announced, and then ask someone to lead the prayer, and I go after those who failed to join the congregational prayer and set fire to them while they are in their houses'. (Reported by Imam Bukhari)"
          ]
        },
        {
          "eleType": "p",
          "id": "",
          "classes": "",
          "insertion": { "location": "", "recitationId": [] },
          "txt": [
            "By virtue of the above quoted Qur'anic verse as well as the various sayings of the Prophet (PBUH), congregational prayer is incumbent upon every male Muslim unless a person is excused from doing so as a result of one or more of the following reasons:"
          ]
        },
        {
          "eleType": "ol",
          "id": "",
          "classes": "",
          "insertion": { "location": "", "recitationId": [] },
          "txt": [
            "Sickness",
            "Fear that going to the mosque will bring about undue hardships, or peril from an enemy.",
            "Heavy rain."
          ]
        },
        {
          "eleType": "p",
          "id": "",
          "classes": "",
          "insertion": { "location": "", "recitationId": [] },
          "txt": [
            "It is permitted for women to attend the congregational prayers at the mosques and their husbands may not prevent them from doing so unless it is feared that harm will come to them. However, it is preferable for women to perform prayers at their homes. The Prophet (PBUH) says:",
            "'Do not prohibit women to attend prayer at mosque, but prayer at their homes is better for them'. (Reported by Imam Ahmad)",
            " If, however, women decide to go out for prayer at the mosques, they should neither dress nor perfume themselves in a manner that may attract the attention of men. At the mosques, it is an established tradition that women perform their prayers preferably in their own partition behind the rows of men."
          ]
        }
      ]
    },
    {
      "heading": "Purpose Of The Congregational Prayer",
      "id": "purposeOfTheCongregationalPrayer",
      "content": [
        {
          "eleType": "p",
          "id": "",
          "classes": "",
          "insertion": { "location": "", "recitationId": [] },
          "txt": [
            "Performance of the prayer in congregation is a great Islamic practice through which equality and justice are made manifest. Here, the ruler and the subject, the old and the young, the rich and the poor, the powerful and the downtrodden, the influential and the wretched all assemble in rows shoulder to shoulder infront of Allah, the Almighty, with neither differences nor distinctions between them - all of them servants of Allah (SWT). .They meet on common ground in the houses of Allah thinking only of Him in humility in due regard to the following verse of the Holy Qur'an:"
          ]
        },
        {
          "eleType": "quote",
          "id": "",
          "classes": "arabicTxt",
          "insertion": { "location": "", "recitationId": [] },
          "txt": ["' إِنَّ أَكْرَمَكُمْ عِنْدَ اللَّهِ أَتْقَاكُمْ' (49:13)"]
        },
        {
          "eleType": "quote",
          "id": "",
          "classes": "arabicTranslation",
          "insertion": { "location": "", "recitationId": [] },
          "txt": [
            "'....Verlly, the most honored of you in the sight of Allah is (he who is) the most righteous of you....' (Holy Qur'an 49:13)"
          ]
        },
        {
          "eleType": "p",
          "id": "",
          "classes": "",
          "insertion": { "location": "", "recitationId": [] },
          "txt": [
            "Islam is a religion of great social order and when a community of Muslims in a given area meet at the Congregational Prayers five times each day, then, certainly, we can imagine the innumerable benefits that could be derived - people knowing each other; people learning each other's affairs; people meeting their leaders and community heads; people discussing and solving their day-to-day problems; people cooperating etc. Thus, cohesiveness, unity, love and brotherhood become truly evident among the Muslim community.",
            "In an Islamic state, the head of the state or his representative is supposed to lead the five daily congregational prayers at the central mosque of the capital city as was the practice of the Prophet (PBUH), in the first Islamic state established at Medina. The leader or head of the Islamic state would, of course, be a person of unquestionable integrity, known to be more knowledgeable than his subjects and above all righteous.",
            "Persons wishing to perform a congregational prayer would choose from amongst themselves an Imam (leader ) who has the qualities described above and who would stand in front of the others at the center of the row.",
            "After the second call for the prayer (Iqamah) is performed, the Imam turns towards the congregation and would endeavor to straighten out the row(s) and urge the congregation to stand close to each other as much as possible. These acts were established practices of the Prophet (PBUH) as can be noted from the following sayings:"
          ]
        },
        {
          "eleType": "ol",
          "id": "",
          "classes": "",
          "insertion": { "location": "", "recitationId": [] },
          "txt": [
            "'Straighten your rows and stand close to each other in prayer...' (Reported by Imam Bukhari)",
            "'You shall have to straighten you rows in prayer or else Allah will create differences among you'. (Reported by Imam Bukhari)"
          ]
        },
        {
          "eleType": "p",
          "id": "",
          "classes": "",
          "insertion": { "location": "", "recitationId": [] },
          "txt": [
            "The Imam, thereafter, starts the prayer with the words of 'Takbiiratil Al-Ihraam' as usual and the congregation would follow suit. The congregation would then proceed to complete the prayer as discussed in detail earlier."
          ]
        }
      ]
    }
  ]
}
