{
  "id": "eidPrayerSection",
  "title": "Eid Prayer",
  "pagination": {
    "previous": "Jummah Prayer",
    "next": "Prayer For Rain"
  },
  "sections": [
    {
      "heading": "The Prayers Of The Two Feasts",
      "id": "thePrayersOfTheTwoFeasts",
      "content": [
        {
          "eleType": "p",
          "id": "",
          "classes": "",
          "insertion": { "location": "", "recitationId": [] },
          "txt": ["These are:"]
        },
        {
          "eleType": "ul",
          "id": "",
          "classes": "",
          "insertion": { "location": "", "recitationId": [] },
          "txt": [
            "The prayer of the Feast of Breaking the Fasting of the month of Ramadan (known as 'Idul-Fitr Prayer')",
            "The prayer of the Feast of Immolation (known as 'Idul-Al-Adha Prayer')"
          ]
        },
        {
          "eleType": "p",
          "id": "",
          "classes": "",
          "insertion": { "location": "", "recitationId": [] },
          "txt": [
            "We shall now discuss the mode of performing each of these prayers."
          ]
        },
        {
          "eleType": "h3",
          "id": "",
          "classes": "",
          "insertion": { "location": "", "recitationId": [] },
          "txt": ["1. 'IDUL-FITR PRAYER"]
        },
        {
          "eleType": "p",
          "id": "",
          "classes": "",
          "insertion": { "location": "", "recitationId": [] },
          "txt": [
            "Upon completion of the obligatory fasting of the blessed month of 'Ramadan', Muslims celebrate the occasion of breaking the Fast by festive celebrations which last for three days. The Muslims welcome the feast with prayer and private supplications and by giving praise to Almighty Allah (SWT). This prayer is performed as follows:"
          ]
        },
        {
          "eleType": "p",
          "id": "",
          "classes": "",
          "insertion": { "location": "", "recitationId": [] },
          "txt": [
            "On the first day of Shawaal (the month that follows Ramadan) the person goes to the 'Id Mosque or praying ground having undertaken the following recommended acts:"
          ]
        },
        {
          "eleType": "ol",
          "id": "",
          "classes": "",
          "insertion": { "location": "", "recitationId": [] },
          "txt": [
            "Taken total ablution (Ghusl).",
            "Dressed in the best of clothes (preferably new clothing's).",
            "Assumed a Breaking of the Fast by eating at least a few pieces of dates. This is in accordance with the tradition of the Prophet (PBUH), and an odd number is preferred i.e. 3, 5, 7, 9 and so on. 4.",
            "It is the practice (Sunnah) to head to the 'Id praying center by walking. Upon arrival at the place of prayer the person sits and waits for the prayer to begin."
          ]
        },
        {
          "eleType": "p",
          "id": "",
          "classes": "",
          "insertion": { "location": "", "recitationId": [] },
          "txt": ["After about 20 minutes from clear sunrise, the Imam: "]
        },
        {
          "eleType": "ul",
          "id": "",
          "classes": "",
          "insertion": { "location": "", "recitationId": [] },
          "txt": [
            "Stands up for the prayer and loudly signifies the entering into prayer by reciting the 'Takbiiratil Ihraam' that is 'ALLAHU AKBAR'. The whole congregation also follows suit by reciting the 'Takbiiratil-lhraam' 8 times.",
            "As usual, with any other prayer, the person thereafter  comes up with the opening supplication known as 'DUA AL ISTIFTAAH.'",
            "After that, the Imam says,'ALLAHU AKBAR' for 6 more times,and the congregation would follow likewise. Between each recitation of 'ALLAHU AKBAR' every person recites to himself in a low voice the following supplication: "
          ]
        },
        {
          "eleType": "quote",
          "id": "",
          "classes": "arabicTransliteration",
          "insertion": { "location": "", "recitationId": [] },
          "txt": [
            "ALLAHU AKBAR KABIIRAA, WAL-HAMDULILLAH KATHIRAA, WA SUBHANNA-LLAHI BUKRATAN WA ASILAA, WAS SALLALAHU 'ALAA MUHAMMADIN WA 'ALAA ALIHI WA SALLAMA TASLIMMAN KATHIIRAA."
          ]
        },
        {
          "eleType": "quote",
          "id": "",
          "classes": "arabicTranslation",
          "insertion": { "location": "", "recitationId": [] },
          "txt": [
            "Allah is great, all thanks and praises are due to Allah, Glory be to Allah, and may Allah bless His messenger and grant him salvation."
          ]
        },
        {
          "eleType": "p",
          "id": "",
          "classes": "",
          "insertion": { "location": "", "recitationId": [] },
          "txt": [
            "Besides the above supplication the person may recite any other recommended supplications."
          ]
        },
        {
          "eleType": "ul",
          "id": "",
          "classes": "",
          "insertion": { "location": "", "recitationId": [] },
          "txt": [
            "Besides the above supplication the person may recite any other recommended supplications.",
            "After completing the recitations of the words of greatness which total up to seven, the Imam would then seek the protection of 'Allah (SWT)' from the cursed satan in a low voice by saying 'AUZU BILLAHI MINAL SHAYTANI RAJIIM'. He would thereafter silently invoke Allah's name by saying: 'BISMILLAHI-R-RAHMANI-RRAHIIM' and then recite 'AL-FATIHAH' (the opening chapter of the Holy Qur'an) in a loud voice. The followers (congregation) would then say 'Ameen' together loudly after the Imam completes reciting the 'Al Fatihah'. Each follower would then recite 'Al-Fatihah' silently. It is recommended that the Imam thereafter recites the whole of chapter 87 of the Holy Qur'an i.e. 'SABIHISMA' (Glorified be the name of thy Lord, the Most high). The followers are required to listen to the Imam's recitation.",
            "The Imam then raises his hands up to the level of his shoulders or ears and performs 'Rukuu' saying 'ALLAHU AKBAR'. Thereafter he raises his head up from bowing saying 'SAMI'A ALLAHU LIMAN HAMIDA' followed by the congregation saying 'RABBANNA WALAKAL HAMD'. The Imam and the congregation thereafter proceed to prostration saying 'ALLAHU AKBAR'.",
            "After the prostrations, the Imam would resume the standing position for the second rakaat and the congregation would follow him up accordingly.",
            "Thereafter, the Imam would say 'ALLAHU AKBAR' for 5 times and the congregation would perform likewise, and would recite the private supplication between each 'Takbiiratil Ihraam' as already discussed in point 4 above.",
            "Then, the Imam recites 'AL-FATIHAH' and for this second rakaat it is preferred that he thereafter recites the whole of chapter 88 of the Holy Qur'an i.e. 'Al-Ghasiya', (The Disaster) and the congregation would listen attentively.",
            "Thereafter, the Imam completes the Rukuu (bowing) and Sujuud (prostration) positions in the manner already discussed and sits back for the words of witness 'At-Tashahud'. Then, the Imam concludes the prayer with the words of peace i.e. 'ASSALAMU ALEYKUM WA RAHMATULLAA' and of course, the entire congregation would follow the Imam in all these acts as is the custom in all prayers.",
            "After concluding the prayer, the Imam would climb the pulpit to deliver the 'Festival Sermon', and starts the same with nine recitations of 'ALLAHU AKBAR' with the congregation saying after him the same. After listening to the sermon, the congregation disperses. Listening to the sermon is not obligatory but is recommended. When going home after the prayer, it is a recommended practice to use another route different from the route used in coming to the mosque/place of prayer."
          ]
        },
        {
          "eleType": "h3",
          "id": "",
          "classes": "",
          "insertion": { "location": "", "recitationId": [] },
          "txt": ["2. 'IDUL ADHA PRAYER"]
        },
        {
          "eleType": "p",
          "id": "",
          "classes": "",
          "insertion": { "location": "", "recitationId": [] },
          "txt": [
            "'IDUL ADHA', (Feast of Immolation) prayer is performed on the 10th day of the 12th month of Islamic 'Hijra' Calendar and is performed exactly in the same manner as enumerated and discussed above for the 'Idul Fitr Prayer."
          ]
        }
      ]
    }
  ]
}
