{
  "id": "conditionsDutiesofSalaatSection",
  "title": "Conditions & Duties of Salaat",
  "pagination": {
    "previous": "Timing of Salaat",
    "next": "Pillars of Salaat"
  },
  "sections": [
    {
      "heading": "Conditions For The Prayer (Shuruut-L-Salaat)",
      "id": "conditionsForThePrayer",
      "content": [
        {
          "eleType": "p",
          "id": "",
          "class": "",
          "insertion": { "location": "", "recitationId": [] },
          "txt": ["Conditions For The Prayer (Shuruut-L-Salaat)"]
        },
        {
          "eleType": "ol",
          "id": "",
          "class": "",
          "insertion": { "location": "", "recitationId": [] },
          "txt": [
            "Acceptance of Islamic Faith - disbelievers are not required to establish Salaat until they believe in 'Allah (SWT)' and bear witness that there is no god but Allah and bear witness that Muhammad is His servant and messenger.",
            "Anniyah - this in Arabic means the intention by heart to perform the particular prayer.",
            "Cleanliness - this includes cleanliness of the body, the clothes and the place where the prayer is to be performed.",
            "Purification - this refers to the performance of Wudhu (or Ghusl where it is required) prior to undertaking the prayer.",
            "Concealing of the Private Parts - for a man, it is essential that he be covered at least from the navel to the knees all round, while, in the case of a woman, her body should be totally covered except for the face and wrists.",
            "Facing the 'Qiblah' - this means that a person when praying must face towards the direction of the sacred mosque in 'Makkah'.Where a person is not able to locate the direction by himself/herself, the person may ask another person who may know the direction of the Qiblah.However, if no one is in sight to guide to the right direction, then, the person should decide for himself/herself and make the best guess of the correct direction of the Qiblah, and accordingly, perform the prayer in that direction even though the guess maybe incorrect. The prayer performed would still be acceptable (Insha Allah) in view of the following verse of the Holy Qur'an.'Whichever direction ye turn, there is the Presence of Allah,' (Qur'an 2:115).'.. فَأَيْنَمَا تُوَلُّوا فَثَمَّ وَجْهُ اللَّهِ ۚ ..' (2:115)",
            "Timing - prayers are to be observed in their prescribed times.",
            "Sanity and consciousness - prayer is required only from persons of sound mind.",
            "Ability to distinguish - prayer is required only where the person (child) is able to distinguish between good and bad, and is able to understand and appreciate fully what is to be recited, performed etc."
          ]
        },
        {
          "eleType": "note",
          "id": "",
          "class": "",
          "insertion": { "location": "", "recitationId": [] },
          "txt": [
            "It is preferred for children to begin performing the prayer at the age of seven for it awakens in them the presence of 'Allah (SWT)' and inculcates in them the habit of praying as an act of worship and love for-Allah (SWT)'. A child at the age of 10 is made to understand that prayer is necessarily a part of the person's daily life and is a solemn duty ordained by 'Allah (SWTron all Muslims, and that failure to  perform it is an act of disbelief (Kufr). Therefore, parents are required to guide their children to the right path by punishing any of them who at the age of 10 intentionally misses the prayers.",
            "The Prophet (PBUH), said:"
          ]
        },
        {
          "eleType": "quote",
          "id": "",
          "class": "arabicTransalation",
          "insertion": { "location": "", "recitationId": [] },
          "txt": [
            "'Order your children to pray when they reach the age of seven and punish them for not performing it at the age of ten and separate them (i.e. boys and girls) in their beds.' (Reported by Imam Buhkari)"
          ]
        },
        {
          "eleType": "p",
          "id": "",
          "class": "",
          "insertion": { "location": "", "recitationId": [] },
          "txt": [
            "Upon attaining the age of 15, a child is deemed to have reached adulthood, whereby, he/she is required to perform the prayer. Here below, are some other signs which may indicate that a child has attained adulthood."
          ]
        },
        {
          "eleType": "ol",
          "id": "",
          "class": "",
          "insertion": { "location": "", "recitationId": [] },
          "txt": [
            "The growing of pubic hairs.",
            "Finding traces of semen on the child's clothes and/or bed.",
            "The start of menstruation, in the case of a girl."
          ]
        }
      ]
    },
    {
      "heading": "Categories Of The Acts Of The Salaat",
      "id": "categoriesOfTheActsOfTheSalaat",
      "content": [
        {
          "eleType": "p",
          "id": "",
          "class": "",
          "insertion": { "location": "", "recitationId": [] },
          "txt": [
            "All the acts, readings and supplications undertaken in the course of the salaat have different legal weights and implications. They are categorised as follows:"
          ]
        },
        {
          "eleType": "ol",
          "id": "",
          "class": "",
          "insertion": { "location": "", "recitationId": [] },
          "txt": [
            "Pillars of the Salaat - (Arkanu-Salaat)",
            "Necessary Duties of the Salaat - (Wajthatu-Salaat)",
            "Preferred Acts of the Salaat - (Sunnanu-Salaat) We shall now discuss each of these categories in turn."
          ]
        }
      ]
    },
    {
      "heading": "Necessary Duties Of The Salaat (Wajibatu-Salaat)",
      "id": "necessaryDutiesOfTheSalaat",
      "content": [
        {
          "eleType": "p",
          "id": "",
          "class": "",
          "insertion": { "location": "", "recitationId": [] },
          "txt": [
            "In addition to the above 14 pillars of the prayer, there are also certain necessary duties which need to be fulfilled in the course of the salaat. These are as follows:"
          ]
        },
        {
          "eleType": "ol",
          "id": "",
          "class": "",
          "insertion": { "location": "", "recitationId": [] },
          "txt": [
            "Saying 'ALLAHU AKBAR' in the course of the prayer where it is necessary, e.g. upon commencing Rukuu etc.,etc.",
            "Saying 'SUBHANAA RABBIYAL AZIM.' when in Rukuu position.",
            "Saying 'SAMI ALLAHU LIMAN HAMIDAH' while resuming standing position from the Rukuu whether the person is an 'Imam' (leader) or is praying alone.",
            "Saying 'RABBANA WALAKAL HAMD' when resuming the standing position from the Rukuu after saying the words: 'SAMI ALLAHU LIMAN HAMIDAH'. This is required from the Imam (leader), from the congregation and even from a person who is praying alone.",
            "Saying 'SUBHANA RABBIYAL A'ALA' when in Sujuud (prostration) position.",
            "Saying 'RABBI IGHFIR LEE' in the sitting pause between the two prostrations of every unit of the prayer.",
            "Taking a Sitting Position for the recitation of At-Tashahud after the first two rakaats (units) of Dhuhr, Asr, Maghrib and Isha prayers.",
            "Reciting the At-Tashahud (words of witness) after the first two rakaats (units) of Dhuhr, Asr, Maghrib and Isha prayers."
          ]
        },
        {
          "eleType": "p",
          "id": "",
          "class": "",
          "insertion": { "location": "", "recitationId": [] },
          "txt": [
            " The above 8 acts constitute the necessary duties of the prayer and if one of them is missed unintentionally, then the person is required to amend the mistake by coming up with the two prostrations of forgetfulness at the end of the prayer. However, if any of these duties is left out deliberately, then the whole prayer is nullified and shall require a repetition."
          ]
        }
      ]
    }
  ]
}
