{
  "title": "Team Profile",
  "profiles": [
    {
      "name": "Khalil Zried",
      "role": "Editor",
      "link": {
        "type": "none",
        "to": ""
      },
      "message": "As a content writer from Gaza, Palestine, living does not come easy for us here. Inspite of all the hardships I've been facing, I have tried to make this guide easy to understand for all muslims around the world. I truly appreciate the efforts of the whole team to make this app easy to understand and use. I wish this app to be a great source to learn everything about salaat."
    },
    {
      "name": "Olesya Gridneva",
      "role": "Illustrator & UI Mentor",
      "link": {
        "type": "behance",
        "to": "https://www.behance.net/olesya_che30d3"
      },
      "message": "As a graphic designer, I tried to draw the pose of a person in prayer that is understandable for any Muslim. I am grateful to my team that they entrusted me with such a responsible job. Download and share the app with friends and acquaintances. It will be a reward for us. We tried and worked honestly."
    },
    {
      "name": "Nathif Jamaa Adam",
      "role": "Original Author",
      "link": {
        "type": "none",
        "to": ""
      },
      "message": "Nathif Jamaa Adam is the original author of the content presented at this site. As the text sourced from the book authored by Nathif Jamaa Adam is over 30 years old, we present his profile here in absence. May Allah SWT reward him for his research & sharing of knowledge with the rest of us. Amen."
    },
    {
      "name": "Nida Zaffar",
      "role": "UI/ UX Designer",
      "link": {
        "type": "behance",
        "to": "https://www.behance.net/nidazaffar"
      },
      "message": "As a UI/UX designer I have tried to make it as easy and clean to read and comprehend for all users around the world. I truly appreciate the efforts of whole team to make this app easy to understand and use. I wish it can be reached by as many people as possible so they can all learn the right and authentic method to offer Salah and that’s the true purpose behind making this app."
    },
    {
      "name": "Salman Khan",
      "role": "Developer",
      "link": {
        "type": "github",
        "to": "https://www.github.com/kay2dan"
      },
      "message": "A few months back, I realised that I needed to be more sincere in my salaat. As a non-arabic speaker, once I read the translation earnestly, it made a significant difference to my focus & intentions. And that was the motivation behind wanting this app out there."
    }
  ]
}
